a=input("введите первый цвет")
b=input("введите второй цвет")
if a == "желтый" and b == "желтый" :
    print("желтый")
if a == "синий" and b == "синий" :
    print("синий")
if a == "красный" and b == "красный" :
    print ("красный")
if a == "желтый" and b == "синий"  or  a == "синий"  and b == "желтый" :
    print("зеленый")
if a == "красный" and b == "синий" or  a == "синий"  and b == "красный" :
    print("фиолетовый")
if a == "красный" and b == "желтый" or  a == "желтый"  and b == "красный" :
    print("оранжевый ")
